### join  
전체 회원의 구매 기록

In [1]:
import pandas as pd
import pymysql

In [2]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [3]:
cur_1=conn1.cursor()

In [4]:
sql='''SELECT U.userID,U.name,B.prodName,U.addr,CONCAT(U.mobile1,U.mobile2) AS '연락처' FROM usertbl U
	LEFT OUTER JOIN buytbl B
    ON U.userID=B.userID
ORDER BY U.userID; '''

In [5]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [6]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

     0    1    2   3           4
0  BBK  바비킴  모니터  서울  0100000000
1  BBK  바비킴  메모리  서울  0100000000
2  BBK  바비킴  운동화  서울  0100000000
3  BBK  바비킴  운동화  서울  0100000000
4  BBK  바비킴  운동화  서울  0100000000

### 유령 회원의 목록

In [7]:
import pandas as pd
import pymysql

In [8]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [9]:
cur_1=conn1.cursor()

In [10]:
sql='''SELECT U.userID,U.name,B.prodName,U.addr,CONCAT(U.mobile1,U.mobile2) AS '연락처' FROM usertbl U
	LEFT OUTER JOIN buytbl B
    ON U.userID=B.userID
    WHERE B.prodName IS NULL
ORDER BY U.userID; '''

In [11]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [12]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

     0    1     2   3           4
0  JKW  조관우  None  경기  0189999999
1  KKH  김경호  None  전남  0193333333
2  LJB  임재범  None  서울  0166666666
3  LSG  이승기  None  서울  0111111111
4  YJS  윤종신  None  경남        None

### 실습5

In [13]:
import pandas as pd
import pymysql

In [14]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [15]:
cur_1=conn1.cursor()

In [16]:
sql='''SELECT S.stdName,S.addr,C.clubName,C.roomNo FROM stdtbl S
	LEFT OUTER JOIN stdclubtbl SC
    ON S.stdName=SC.stdName
    LEFT OUTER JOIN clubtbl C 
    ON SC.clubName=C.clubName
    ORDER BY S.stdName;'''

In [17]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [18]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

     0   1   2     3
0  김범수  경남  바둑  102호
1  김범수  경남  축구  103호
2  김범수  경남  바둑  102호
3  김범수  경남  축구  103호
4  바비킴  서울  봉사  104호

In [19]:
import pandas as pd
import pymysql

In [20]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [21]:
cur_1=conn1.cursor()

In [22]:
sql='''SELECT C.clubName,C.roomNo,S.stdName,S.addr FROM stdtbl S
	LEFT OUTER JOIN stdclubtbl SC
    ON SC.stdName=S.stdName
    RIGHT OUTER JOIN clubtbl C 
    ON SC.clubName=C.clubName
    ORDER BY C.clubName;'''

In [23]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [24]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

    0     1    2   3
0  바둑  102호  김범수  경남
1  바둑  102호  김범수  경남
2  봉사  104호  은지원  경북
3  봉사  104호  바비킴  서울
4  봉사  104호  은지원  경북

In [25]:
import pandas as pd
import pymysql

In [26]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [27]:
cur_1=conn1.cursor()

In [28]:
sql='''SELECT S.stdName,S.addr,C.clubName,C.roomNo FROM stdtbl S
	LEFT OUTER JOIN stdclubtbl SC
    ON S.stdName=SC.stdName
    LEFT OUTER JOIN clubtbl C 
    ON SC.clubName=C.clubName
UNION
SELECT C.clubName,C.roomNo,S.stdName,S.addr FROM stdtbl S
	LEFT OUTER JOIN stdclubtbl SC
    ON SC.stdName=S.stdName
    RIGHT OUTER JOIN clubtbl C 
    ON SC.clubName=C.clubName;'''

In [29]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [30]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

     0   1     2     3
0  김범수  경남    바둑  102호
1  김범수  경남    축구  103호
2  바비킴  서울    봉사  104호
3  성시경  서울  None  None
4  은지원  경북    축구  103호